Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/implementation-notes_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: Now that both `CompositeComponent` and `DOMComponent` implement the `receive(nextElement)` method, we can change the top-level `mountTree()` function to use it when the element `type` is the same as it was the last time:
ja: ここまでで `CompositeComponent` と `DOMComponent` の両方ともが `receive(nextElement)` メソッドを実装しているので、要素の type が前回と同じだった場合は最上位の `mountTree()`関数がそれを使えるよう、この関数を書き換えることができます：

source: Now calling `mountTree()` two times with the same type isn't destructive:
ja: これで、同じ型で `mountTree()` を 2 回呼び出しても、破壊的な変更にはなりません：

source: These are the basics of how React works internally.
ja: 以上の処理が React 内部での動作の仕組みの基本です。

source: ### What We Left Out {#what-we-left-out}
ja: ### このドキュメントで除外したもの {#what-we-left-out}

source: This document is simplified compared to the real codebase.
ja: このドキュメントは、実際のコードベースよりもシンプルなものになっています。

source: There are a few important aspects we didn't address:
ja: ここでは言及しなかった重要なポイントがいくつかあります：

source: * Components can render `null`, and the reconciler can handle "empty slots" in arrays and rendered output.
ja: * コンポーネントは `null` をレンダーでき、リコンサイラは配列やレンダーされた出力における「空スロット」部分を扱うことができます。

source: * The reconciler also reads `key` from the elements, and uses it to establish which internal instance corresponds to which element in an array.
ja: * リコンサイラは要素から `key` も読み取り、どの内部インスタンスが配列中のどの要素と対応するかを確認するのに使用します。

source: A bulk of complexity in the actual React implementation is related to that.
ja: 実際の React の実装における複雑さのかなりの部分が、この箇所に関わるものです。

source: * In addition to composite and host internal instance classes, there are also classes for "text" and "empty" components.
ja: * composite と host 型の内部インスタンスのクラスに加えて、"text" と "empty" コンポーネントのクラスもあります。

source: They represent text nodes and the "empty slots" you get by rendering `null`.
ja: それらはテキストノードと、`null` をレンダーすると得られる「空のスロット」を表します。

source: * Renderers use [injection](/docs/codebase-overview.html#dynamic-injection) to pass the host internal class to the reconciler.
ja: * レンダラは[依存性注入](/docs/codebase-overview.html#dynamic-injection)を利用して host 内部クラスをリコンサイラに渡します。

source: For example, React DOM tells the reconciler to use `ReactDOMComponent` as the host internal instance implementation.
ja: 例えば、React DOM はリコンサイラに `ReactDOMComponent` を host 内部インスタンスの実装として使用するように指示します。

source: * The logic for updating the list of children is extracted into a mixin called `ReactMultiChild` which is used by the host internal instance class implementations both in React DOM and React Native.
ja: * 子要素のリストを更新するロジックは `ReactMultiChild` と呼ばれるミックスインに抽出され、そのミックスインが、React DOM および React Native 両方における host 内部インスタンスのクラスの実装に使用されます。

source: * The reconciler also implements support for `setState()` in composite components.
ja: * リコンサイラは composite 要素における `setState()` のサポートも実装しています。

source: Multiple updates inside event handlers get batched into a single update.
ja: イベントハンドラ内部での複数の更新は、単一の更新にバッチ処理されます。

source: * The reconciler also takes care of attaching and detaching refs to composite components and host nodes.
ja: * リコンサイラは、composite コンポーネントおよび host ノードへの ref の追加と削除についても対応しています。

source: * Lifecycle methods that are called after the DOM is ready, such as `componentDidMount()` and `componentDidUpdate()`, get collected into "callback queues" and are executed in a single batch.
ja: * DOM の準備ができあがった後に呼び出される、`componentDidMount()` や `componentDidUpdate()` のようなライフサイクルメソッドは `callback queues` に集められ、単一のバッチの中で実行されます。

source: * React puts information about the current update into an internal object called "transaction".
ja: * React は現時点での更新についての情報を「トランザクション ("transaction")」と呼ばれる内部オブジェクトに格納します。

source: Transactions are useful for keeping track of the queue of pending lifecycle methods, the current DOM nesting for the warnings, and anything else that is "global" to a specific update.
ja: トランザクションは、保留中のライフサイクルメソッドのキューや、警告の際に使用する現在の DOM のネスト構造、そしてある特定の更新に対して「グローバル」になっているその他あらゆるものの経過を追うのに重宝します。

source: Transactions also ensure React "cleans everything up" after updates.
ja: トランザクションによって React が更新後に「全てをクリーンアップする」よう保証できます。

source: For example, the transaction class provided by React DOM restores the input selection after any update.
ja: 例えば、React DOM が提供するトランザクションクラスは、入力フィールドの選択状態を更新後に復元します。

source: ### Jumping into the Code {#jumping-into-the-code}
ja: ### コードに飛び込む {#jumping-into-the-code}

source: * [`ReactMount`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/dom/client/ReactMount.js) is where the code like `mountTree()` and `unmountTree()` from this tutorial lives.
ja: * [`ReactMount`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/dom/client/ReactMount.js) はこのチュートリアルにある `mountTree()` や `unmountTree()` のようなコードがある場所です。

source: It takes care of mounting and unmounting top-level components.
ja: ここでは最上位コンポーネントのマウントやアンマウントが行われます。

source: [`ReactNativeMount`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/native/ReactNativeMount.js) is its React Native analog.
ja: [`ReactNativeMount`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/native/ReactNativeMount.js) はその React Native 版です。

source: * [`ReactDOMComponent`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/dom/shared/ReactDOMComponent.js) is the equivalent of `DOMComponent` in this tutorial.
ja: * [`ReactDOMComponent`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/dom/shared/ReactDOMComponent.js) はこのチュートリアルでの `DOMComponent` にあたります。

source: It implements the host component class for React DOM renderer.
ja: これは、React DOM レンダラ向けの host コンポーネントクラスを実装するものです。

source: [`ReactNativeBaseComponent`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/native/ReactNativeBaseComponent.js) is its React Native analog.
ja: [`ReactNativeBaseComponent`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/native/ReactNativeBaseComponent.js) はその React Native 版です。

source: * [`ReactCompositeComponent`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/shared/stack/reconciler/ReactCompositeComponent.js) is the equivalent of `CompositeComponent` in this tutorial.
ja: * [`ReactCompositeComponent`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/shared/stack/reconciler/ReactCompositeComponent.js) はこのチュートリアルでの `CompositeComponent` にあたります。

source: It handles calling user-defined components and maintaining their state.
ja: これは、ユーザ定義コンポーネントの呼び出しとその state の保持を扱います。

source: * [`instantiateReactComponent`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/shared/stack/reconciler/instantiateReactComponent.js) contains the switch that picks the right internal instance class to construct for an element.
ja: * [`instantiateReactComponent`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/shared/stack/reconciler/instantiateReactComponent.js) はある要素に対して構築すべき正しい内部インスタンスクラスを選ぶスイッチを持っています。

source: It is equivalent to `instantiateComponent()` in this tutorial.
ja: これは、このチュートリアルにおける `instantiateComponent()` にあたります。

source: * [`ReactReconciler`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/shared/stack/reconciler/ReactReconciler.js) is a wrapper with `mountComponent()`, `receiveComponent()`, and `unmountComponent()` methods.
ja: * [`ReactReconciler`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/shared/stack/reconciler/ReactReconciler.js) は `mountComponent()`、`receiveComponent()`、そして `unmountComponent()` メソッドのラッパーです。

source: It calls the underlying implementations on the internal instances, but also includes some code around them that is shared by all internal instance implementations.
ja: これは水面下で内部インスタンスの実装を呼び出しますが、それらに追加するコードも含んでおり、その追加コードは全ての内部インスタンスの実装で共有されます。

source: * [`ReactChildReconciler`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/shared/stack/reconciler/ReactChildReconciler.js) implements the logic for mounting, updating, and unmounting children according to the `key` of their elements.
ja: * [`ReactChildReconciler`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/shared/stack/reconciler/ReactChildReconciler.js) は子要素を要素の `key` に基づいてマウント、更新、そしてアンマウントするロジックを実装しています。

source: * [`ReactMultiChild`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/shared/stack/reconciler/ReactMultiChild.js) implements processing the operation queue for child insertions, deletions, and moves independently of the renderer.
ja: * [`ReactMultiChild`](https://github.com/facebook/react/blob/83381c1673d14cd16cf747e34c945291e5518a86/src/renderers/shared/stack/reconciler/ReactMultiChild.js) は、子要素の挿入、削除、そして移動の操作に関するキューの処理を、レンダラとは独立して実装します。

source: * `mount()`, `receive()`, and `unmount()` are really called `mountComponent()`, `receiveComponent()`, and `unmountComponent()` in React codebase for legacy reasons, but they receive elements.
ja: * `mount()` と `receive()`、そして `unmount()` は、実際の React のコードベースでは歴史的な理由から、`mountComponent()`、`receiveComponent()`、そして `unmountComponent()`と呼ばれていますが、これらは要素を受け取っています。

source: * Properties on the internal instances start with an underscore, e.g. `_currentElement`.
ja: * 内部インスタンス上のプロパティ名は、`_currentElement` のようにアンダースコアから始まります。

source: They are considered to be read-only public fields throughout the codebase.
ja: これらはコードベース全体を通じて、読み取り専用の public なフィールドと見なされます。

source: ### Future Directions {#future-directions}
ja: ### 今後の方向性 {#future-directions}

source: Stack reconciler has inherent limitations such as being synchronous and unable to interrupt the work or split it in chunks.
ja: stack リコンサイラには、同期的処理であることや、作業を中断したりチャンクに分割したりできないといったことなど、固有の制限があります。

source: There is a work in progress on the [new Fiber reconciler](/docs/codebase-overview.html#fiber-reconciler) with a [completely different architecture](https://github.com/acdlite/react-fiber-architecture).
ja: 現在、[全く異なるアーキテクチャ](https://github.com/acdlite/react-fiber-architecture)による[新たな Fiber リコンサイラ](/docs/codebase-overview.html#fiber-reconciler)の開発が進行中です。

source: In the future, we intend to replace stack reconciler with it, but at the moment it is far from feature parity.
ja: 将来的には、stack リコンサイラをこれに置き換える予定ですが、現時点では同等の機能を提供するには程遠い状態です。

source: ### Next Steps {#next-steps}
ja: ### 次のステップ {#next-steps}

source: Read the [next section](/docs/design-principles.html) to learn about the guiding principles we use for React development.
ja: React の開発時に私たちが使用するガイドラインについて学ぶには、[次の章](/docs/design-principles.html)を読んでください。
